/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：ares
2. 文件名：src -> configs -> mail.js
3. 作者：zhaohuagang@lifang.com
4. 备注：邮件发送功能模块
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
/*
	最初的设想是在调用接口失败时发送邮件给相关的接口开发，不过一直没有使用这个功能。具体发送逻辑在apiDataFilter.js中
*/
export default {
  "host" : "smtp.exmail.qq.com" ,
  "secure" : true ,
  "port" : 465 ,
  "auth" : {
    "user" : "reminder@lifang.com" ,
    "pass" : "WkzfWFE2017"
  }
}