/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：ares
2. 文件名：src -> system -> core -> controllers -> basic.js
3. 作者：zhaohuagang@lifang.com
4. 备注：系统核心 -> 所有控制器类的祖宗
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
class SystemControllerBasic {
    constructor(req, res, next) {
        this.req = req ;
        this.res = res ;
        this.next = next ;        
    }
}

export default SystemControllerBasic ;