/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：ares
2. 文件名：src -> application -> routers -> common.js
3. 作者：zhaohuagang@lifang.com
4. 备注：wkh5 -> common模块路由器
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/

/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
加载相关资源
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
import express from "express" ;
import CommonDialApiProvider from "../controllers/common/dialApiProvider" ;
import CommonBigDataApiProvider from "../controllers/common/bigDataApiProvider" ;
import CommonGetCityByLatLonApiProvider from "../controllers/common/getCityByLatLonApiProvider" ;
import CommonBusinessCityApiProvider from "../controllers/common/businessCityApiProvider" ;
import CommonAcWordApiProvider from "../controllers/common/acWordApiProvider";
let router = express.Router() ;
/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
/api/common/dial 的路由规则，通过agentId , houseId , serviceType获得短接号
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
router.get("/api/common/dial", function( req , res , next ) {      
    new CommonDialApiProvider(req, res, next) ;  
}) ;
/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
/api/common/bigData 的路由规则，大数据埋点
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
router.get("/api/common/bigData", function( req , res , next ) {      
    new CommonBigDataApiProvider(req, res, next) ;  
}) ;

/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
/api/common/getCityByLatLon 的路由规则，通过经纬度反查城市及开通业务
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
router.get("/api/common/getCityByLatLon", function( req , res , next ) {
    new CommonGetCityByLatLonApiProvider(req, res, next) ;
}) ;

/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
/api/common/businessCity 的路由规则，通过业务类型查询开通此业务的城市清单
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
router.get("/api/common/businessCity", function( req , res , next ) {
    new CommonBusinessCityApiProvider(req, res, next) ;
}) ;
/*++-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
/api/common/acWord 的路由规则
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
router.get("/api/common/acWord", function(req, res, next) {
    new CommonAcWordApiProvider(req, res, next) ;
}) ;

export default router ;